### Data Cleaning & Preparation

In [ ]:
import pandas as pd
import numpy as np

In [2]:
# Detecting missing values in a string series using .isnull () 

string_data = pd.Series(['whale', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0        whale
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data_fun = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data_fun.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
# Alternative but equivalent method

data_fun[data_fun.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
# Using dropna () in a dataframe

data = pd.DataFrame([[1., 7.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  7.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  7.5  3.0

In [17]:
# Passing how = 'all' will only drop rows that are all NA
data.dropna(how = 'all')

     0    1    2
0  1.0  7.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# Passing axis=1 will only drop columns that are all NA
data[4] = NA

In [19]:
data

     0    1    2   4
0  1.0  7.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  7.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
# Filling in missing data with fillna ()
df = pd.DataFrame(np.random.randn(5,3))

In [28]:
df

          0         1         2
0  0.555606  1.139797 -0.836557
1 -1.525797  0.174728 -0.911144
2 -0.534319  1.739060  0.669914
3 -1.939687 -0.052270 -1.091420
4  0.280367 -0.265925 -1.387586

In [30]:
df.iloc[:3, 2] = NA

In [31]:
df

          0         1         2
0  0.555606  1.139797       NaN
1 -1.525797  0.174728       NaN
2 -0.534319  1.739060       NaN
3 -1.939687 -0.052270 -1.091420
4  0.280367 -0.265925 -1.387586

In [32]:
df.fillna(0)

          0         1         2
0  0.555606  1.139797  0.000000
1 -1.525797  0.174728  0.000000
2 -0.534319  1.739060  0.000000
3 -1.939687 -0.052270 -1.091420
4  0.280367 -0.265925 -1.387586

In [36]:
# other interpolations may include using fillna () to fill mean or median value of a Series
data = pd.Series([1., NA, 3.5, NA, 7])

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [38]:
data.fillna(data.median())

0    1.0
1    3.5
2    3.5
3    3.5
4    7.0
dtype: float64

In [48]:
# Data transformations - removing duplicates
data1 = pd.DataFrame({'cat': [1,1,3,4,5,4,9], 'dog' : ['one', 'two'] * 3 + ['two']})

In [49]:
data1

   cat  dog
0    1  one
1    1  two
2    3  one
3    4  two
4    5  one
5    4  two
6    9  two

In [50]:
data1.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [51]:
data1.drop_duplicates()

   cat  dog
0    1  one
1    1  two
2    3  one
3    4  two
4    5  one
6    9  two

In [55]:
# Replacing sentinel values such as 999. with NaN
data2 = pd.Series([1., 999., 5, 999., 1000., 3.])

In [56]:
data2

0       1.0
1     999.0
2       5.0
3     999.0
4    1000.0
5       3.0
dtype: float64

In [54]:
data.replace(999., np.nan)

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data3 = pd.DataFrame(np.arange(12).reshape((3,4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [18]:
data3

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [6]:
transform = lambda x: x[:4].upper()

In [12]:
data3.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [15]:
data3.index = data3.index.map(transform)

In [16]:
data3

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [19]:
data3.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
# Detecting and filtering

dataz = pd.DataFrame(np.random.randn(1000, 5))

In [23]:
dataz.describe()

                 0            1            2            3            4
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.023938    -0.034986     0.005643    -0.007936     0.005579
std       0.976120     1.034611     0.968335     1.015172     1.006154
min      -3.603767    -3.067808    -3.017766    -3.545606    -2.964665
25%      -0.642329    -0.752621    -0.648421    -0.680054    -0.696625
50%      -0.015465    -0.008173     0.028976     0.000058     0.020968
75%       0.657046     0.665182     0.629230     0.687883     0.708283
max       2.777428     3.218698     3.575109     3.029501     3.328246

In [24]:
# np.sign(data) produces 1 and -1 values based on whether values are positive or negative 
np.sign(dataz).head()

     0    1    2    3    4
0  1.0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0  1.0

In [25]:
# Permutation and Random Sampling

fun = pd.DataFrame(np.arange(5 * 3).reshape((5, 3)))

In [26]:
sampler = np.random.permutation(5)

In [27]:
sampler

array([1, 3, 4, 2, 0])

In [28]:
fun

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [29]:
# Select a random subset of the array without replacement, use the 'sample' method
fun.sample(n=3)

    0   1   2
4  12  13  14
2   6   7   8
3   9  10  11

In [31]:
# To generate a sample with replacement (to allow for repeats), pass 'replace=True'

choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10, replace=True)
draws

4    4
4    4
2   -1
3    6
3    6
4    4
2   -1
0    5
0    5
1    7
dtype: int64

In [2]:
# Computing indicator/ Dummy Variables

#dummies = pd.get_dummies(df['Category']).rename(columns=lambda x: 'Category_' + str(x))
#df = pd.concat([df, dummies], axis=1)
#df = df.drop(['Category'], inplace=True, axis=1)

In [2]:
# Regex used to describe one or more whitespace characters '\s+'
# Import the re module used for regular expressions

import re

In [3]:
text = "foo     bar\t baz   \tqux"

In [4]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [5]:
# Alternative way to do this

In [6]:
regex = re.compile('\s+')

In [7]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [8]:
# Vectorized string operations

data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [9]:
data = pd.Series(data)

In [10]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [12]:
# Filter out the missing values using boolean

data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [14]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [15]:
# Slice strings 

data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object

In [16]:
data.str[:2]

Dave      da
Rob       ro
Steve     st
Wes      NaN
dtype: object